Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་བྲམ་ཟེ་མེས་སྦྱིན་ལ་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་སྟོན་པར་མཛད། ཡང་དག་པར་འཛིན་དུ་འཇུག་པར་མཛད། ཡང་དག་པར་གཟེངས་སྟོད་པར་མཛད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་དེ།
en: Then the Blessed One, through talk consistent with the Dharma, instructed, inspired, encouraged, and delighted Agnidatta, the brahmin king.

source: རྣམ་གྲངས་དུ་མར་ཆོས་དང་ལྡན་པའི་གཏམ་གྱིས་ཡང་དག་པར་བསྟན། ཡང་དག་པར་འཛིན་དུ་འཇུག །ཡང་དག་པར་གཟེངས་བསྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་མཛད་ནས་གདན་ལས་བཞེངས་ཏེ་གཤེགས་སོ།
en: The Blessed One, having instructed, inspired, encouraged, and delighted Agnidatta in a variety of ways through talk consistent with the Dharma, then rose from his seat and departed. C.

source: །དེ་ནས་དགེ་སློང་རབ་ཏུ་མང་པོ་དབྱར་ཟླ་བ་གསུམ་པོ་དག་འདས་ནས་ཆོས་གོས་བྱས་པ་དང་ལྡན། ཆོས་གོས་ཟིན་པ་དང་ལྡན་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་དོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Breaking a Hut After the three months of the rainy season had passed, many monks, having made and patched their robes, went to the Blessed One. When they arrived, they bowed low until their foreheads touched the Blessed One’s feet, and then they sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་དགེ་སློང་རབ་ཏུ་མང་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ཅག་གིས་ཡུལ་དགྲ་མཐའ་རྣམས་སུ་དགུང་ཟླ་གསུམ་མཆིས་ལགས་ཀྱིས།
en: Having sat down to one side, the many monks said to the Blessed One, “O Honored One, we have stayed in the country of Vairambhya for three months.

source: བཙུན་པ་སྤྱིལ་བུ་གཞིག་ལགས་སོ།
en: O Honored One, we will break the huts.”

source: །དགེ་སློང་དག་ཁྱེད་ཀྱིས་སྤྱིལ་བུ་མ་གཞིག་ཤིག །སྤྱིལ་བུ་རྣམས་ཇི་སྲིད་དུ་ཡུན་རིང་དུ་གནས་པར་གྱུར་པ་དེ་སྲིད་དུ་སྦྱིན་བདག་གི་བསོད་ནམས་འཕེལ་བར་འགྱུར་བ་ཉིད་དང་། བསོད་ནམས་སྐྱེད་པར་འགྱུར་བ་ཉིད་དོ།
en: “Monks, you should not break the huts. The longer the huts last, the more the donors’ merit increases and the more merit is generated.

source: །བཞི་པོ་འདི་དག་ནི་སྦྱིན་པ་པོ་དང་སྦྱིན་བདག་གི་བསོད་ནམས་ཀྱི་རྒྱུ་མཐུན་པ་དང་། དགེ་བའི་རྒྱུ་མཐུན་པ་དང་། བདེ་བའི་གཞི་ཡིན་པར་རིག་པར་བྱ་སྟེ།
en: There are four things that are to be known as the outcomes of merits and virtues and the cause of the happiness of benefactors and donors.

source: དགེ་སློང་ཚུལ་ཁྲིམས་དང་ལྡན་ཞིང་དགེ་བའི་ཆོས་ལ་གནས་པ་ཞིག་གང་གིས་གཙུག་ལག་ཁང་ན་གནས་ཤིང་སེམས་ཀྱི་ཏིང་ངེ་འཛིན་ཚད་མེད་པ་ལུས་ཀྱིས་མངོན་སུམ་དུ་བྱས་ནས་རྫོགས་པར་བྱས་ཏེ་གནས་ན་གཞི་དེ་ལས་སྦྱིན་པ་པོ་དང་སྦྱིན་བདག་གི་བསོད་ནམས་ཀྱི་རྒྱུ་མཐུན་པ་དང་། དགེ་བའི་རྒྱུ་མཐུན་པ་དང་། བདེ་བའི་གཞི་དཔག་ཏུ་མེད་པར་རིག་པར་བྱའོ།
en: “If a virtuous monk who abides in good qualities lives in someone’s monastery, having actualized and perfected with his body immeasurable meditation, the outcomes of merits and virtues and the cause of the happiness of benefactors and donors should be known to be immeasurable for that reason.

source: །གཙུག་ལག་ཁང་ཇི་ལྟ་བར་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། གནས་མལ་ཡང་དེ་དང་འདྲ་སྟེ།
en: “Just like the monastery, the same applies to robes, almsfood, and bedding and seats.

source: བསོད་ནམས་ཀྱི་རྒྱུ་མཐུན་པ་དང་། དགེ་བའི་རྒྱུ་མཐུན་པ་དང་། བདེ་བའི་གཞི་བཞི་པོ་འདི་དང་ལྡན་པའི་སྦྱིན་པ་པོ་དང་སྦྱིན་བདག་གི་བསོད་ནམས་ཀྱི་ཚད་རེ་ཞིག་བསོད་ནམས་སམ། བསོད་ནམས་ཀྱི་འབྲས་བུའམ། བསོད་ནམས་ཀྱི་འབྲས་བུའི་རྣམ་པར་སྨིན་པ་འདི་ཙམ་མོ་ཞེས་གཟུང་བར་མི་ནུས་ཏེ། འོན་ཀྱང་བསོད་ནམས་ཆེ་བའི་ཕྱིར་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོའོ།
en: “The amount of the merits of the benefactors and donors who have these four outcomes of merits and virtues and the cause of happiness cannot be grasped as ‘the merit, the fruit of merit, or the fruit of merit that has matured is this much,’ but rather they can only be measured as a large mass of merits because of the sheer abundance of merit.

source: །དཔེར་ན་ཆུ་བོ་ཆེན་པོ་ལྔ་པོ་འདི་ལྟ་སྟེ། གང་གཱ་དང་། ཡ་མུ་ན་དང་། སར་ཡུ་དང་། གནས་ལྡན་དང་། ཆེན་པོ་ཞེས་བྱ་བ་དེ་དག་འབབ་ཅིང་འདྲེ་བར་འགྱུར་བ་དེ་ལ་ནི་ཆུའི་ཚད་ཆུའམ། ཆུ་བུམ་པའམ། ཆུ་བུམ་པ་བརྒྱའམ། ཆུ་བུམ་པ་སྟོང་ངམ།
en: “Take, for instance, the place where the five great rivers—namely, the Ganges, Yamunā, Sarayū, Ajiravatī, and Mahī—descend and converge, where the amount of water cannot be grasped as water, a pot of water, or a hundred, a thousand, or a hundred thousand pots of water, but can only be measured as a great mass of water because of the sheer abundance of water.

source: ཆུ་བུམ་པ་བརྒྱ་སྟོང་འདི་སྙེད་ཅེས་གཟུང་བར་མི་ནུས་ཏེ། འོན་ཀྱང་ཆུ་མང་བའི་ཕྱིར་ཆུའི་ཚོགས་ཆེན་པོ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོ་བ་དེ་བཞིན་དུ་བསོད་ནམས་ཀྱི་རྒྱུ་མཐུན་པ་དང་། དགེ་བའི་རྒྱུ་མཐུན་པ་དང་། བདེ་བའི་གཞི་བཞི་པོ་འདི་དག་དང་ལྡན་པའི་སྦྱིན་པ་པོ་དང་། སྦྱིན་བདག་གི་བསོད་ནམས་ཀྱི་ཚད་བསོད་ནམས་སམ། བསོད་ནམས་ཀྱི་འབྲས་བུའམ། བསོད་ནམས་ཀྱི་འབྲས་བུ་རྣམ་པར་སྨིན་པ་འདི་ཙམ་མོ་ཞེས་གཟུང་བར་མི་ནུས་ཏེ། འོན་ཀྱང་བསོད་ནམས་ཆེ་བའི་ཕྱིར་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་ཞེས་བྱ་བའི་གྲངས་སུ་འགྲོའོ།
en: So, too, the amount of the merits of the benefactors and donors who have these four outcomes of merits and virtues and the cause of happiness cannot be grasped as ‘the merit, the fruit of merit, or the fruit of merit that has matured is this much,’ but they can only be measured as a large mass of merits.

source: །ཇི་ལྟར་རྒྱ་མཚོ་བཀྲ་ཤིས་གཙང་ལ་དག །ངོགས་བདེ་རིན་ཆེན་འབྱུང་གནས་མཚོ་མཆོག་དེར།
en: “In the auspicious, pure ocean, in the best sea, Which has pleasant shores and produces jewels,

source: །མི་དང་རི་དགས་ཚོགས་ཀྱིས་བསྟེན་པ་ཡི། །ཆུ་བོ་སོ་སོ་ནས་འབབ་འདུ་བ་ལྟར།
en: The currents of each river, On which humans and animals rely, gather.

source: །དེ་བཞིན་གོས་དང་ཟས་སྐོམ་སྟེར་བའི་མི།
en: “So, too, to a person who donates clothes, food, and drink,

source: །མལ་ཆ་སྟན་དང་གདིང་བ་སྦྱིན་བྱེད་ལ།
en: After they have given bedding and seats and carpets,

source: །བསོད་ནམས་རྒྱུན་ནི་ཀུན་ནས་འདུ་འགྱུར་ཏེ།
en: Streams of merits gather from everywhere,

source: །དཔེར་ན་རྒྱ་མཚོར་ཆུ་ཀླུང་འབབ་པ་བཞིན།
en: In the same way rivers descend to the ocean.” D. A Brahmin Who Abused the Buddha Vipaśyin

source: །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྲིན་ལས་ཅི་ཞིག་མཛད་ན། གང་གིས་ན་ཕྱག་དང་། ཞབས་དང་། དབུ་ལ་སོགས་པ་བཀུམ་པ་ལ་སོགས་པའི་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱིས་སློང་མོ་པའི་སྐྱེ་བོ་ཚིམ་པར་མཛད་དེ། བསྐལ་པ་གྲངས་མ་མཆིས་པ་གསུམ་དུ་སེམས་ཅན་གྱི་དོན་གྱི་སླད་དུ་བདག་ཉིད་འོ་བརྒྱལ་ནས་མཛད་པ་ཐམས་ཅད་མཛད་ལགས་པ། ཡུལ་དགྲ་མཐའ་ན་དགེ་སློང་ལྔ་བརྒྱར་གཉིས་ཀྱིས་མ་ཚང་བ་དང་ཐབས་ཅིག་ཏུ་ནས་རུལ་པ་གསོལ་ལ།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, the Blessed One has satisfied poor people through a multitude of merits by cutting off his hands, feet, head, and so on—he has tormented himself for the sake of beings during three incalculably long eons, and has done all that is to be done.

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་གཉིས་ནི་བདུད་རྩི་འཚལ་ལགས།
en: And so what karma did he create that matured to cause him to have coarse barley with the four hundred ninety-eight monks in Vairambhya, while the venerables Śāriputra and Maudgalyāyana had divine nectar?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱིས་སྔོན་གྱི་ཚེ་རབས་གཞན་རྣམས་སུ་ལས་བྱས་ཤིང་བསགས་པ་ཞེས་བྱ་བ་ནས།
en: “Monks,” The Blessed One replied, “the actions were performed and accumulated by the Tathāgata himself in the past, in other lives, . . . . “. . .

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱད་ཁྲི་ཐུབ་པ་ན་འཇིག་རྟེན་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམ་པར་གཟིགས་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ།
en: “Monks, once, when people’s lifespans were eighty thousand years long, there appeared in the world a teacher named Vipaśyin, who was a tathāgata, an arhat, a perfectly awakened one, perfect in knowledge and conduct, a sugata, world knowing, a supreme tamer of people to be tamed, a teacher of gods and humans, a buddha, and a blessed one.

source: དེ་འཁོར་དགེ་སློང་བརྒྱད་ཁྲི་དང་རྒྱལ་པོའི་ཕོ་བྲང་གཉེན་ལྡན་ཞེས་བྱ་བ་ན་ཉེ་བར་རྟེན་ཅིང་བཞུགས་སོ།
en: He stayed near a royal capital called Bandhumatī with eight hundred thousand monks who were his attendants.

source: །དེའི་ཚེ་རྒྱལ་པོའི་ཕོ་བྲང་གཉེན་ལྡན་ན་ཚོགས་རྣམས་སློབ་པར་བྱེད་པའི་བྲམ་ཟེ་ཞིག་ལྔ་བརྒྱའི་ཚོགས་ལ་བྲམ་ཟེའི་གསང་ཚིག་འདོན་དུ་འཇུག་སྟེ།
en: “At that time in Bandhumatī, the royal capital, a brahmin schoolteacher was teaching brahmanical mantras to five hundred students.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ཀྱང་ལྷག་པར་བཀུར་སྟི་བྱས། རིམ་གྲོར་བྱས། རྗེད་པར་བྱས།
en: He was treated by everyone in the world with honor, looked up to, esteemed, venerated, and paid homage to as a worthy man.

source: མཆོད་པར་བྱས་ཏེ་དགྲ་བཅོམ་པར་བཀུར་རོ། །གང་ཁོ་ན་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་རྒྱལ་པོའི་ཕོ་བྲང་གཉེན་ལྡན་དུ་གཤེགས་པ་དེ་ཁོ་ན་ནས་བཟུང་སྟེ།
en: After the Perfectly Awakened One Vipaśyin arrived at Bandhumatī, the royal capital, however, none treated him with honor, looked up to him, esteemed him, or venerated him.

source: དེ་ལ་སུ་ཡང་བཀུར་སྟི་བྱ་བ་དང་། རིམ་གྲོར་བྱ་བ་དང་། རྗེད་པར་བྱ་བ་དང་། མཆོད་པར་བྱ་བ་མི་བྱེད་པ་དང་། དེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པ་ལ་ཤིན་ཏུ་ཕྲག་དོག་སྐྱེས་པར་གྱུར་ཏོ།
en: He became very jealous of the Perfectly Awakened One Vipaśyin and his community of disciples.

source: །ཇི་ཙམ་ན་དགེ་སློང་སློབ་པ་དང་མི་སློབ་པ་རབ་ཏུ་མང་པོ་སྔ་དྲོ་ཤམ་ཐབས་བགོས་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ།
en: “Later, early one morning many monks—those who were undergoing training and those who had completed training—dressed, took their bowls and their robes, and entered Bandhumatī, the royal capital, for alms.

source: རྒྱལ་པོའི་ཕོ་བྲང་གཉེན་ལྡན་དུ་བསོད་སྙོམས་ལ་ཞུགས་པ་དང་། དེ་ནས་ཚོད་མ་རོ་སྣ་ཚོགས་དང་ལྡན་པ་དང་འབྲས་ཆན་གྱིས་ལྷུང་བཟེད་བཀང་ནས་སླར་ལོག་པ་བྲམ་ཟེ་དེས་མཐོང་ནས་དྲིས་པ། ཀྱེ་དགེ་སློང་དག་ཇི་འདྲ་བའི་བསོད་སྙོམས་ཞིག་རྙེད་བལྟའོ།
en: Having seen them return with their bowls filled with various kinds of tasty sauce and rice, the brahmin demanded, ‘Hey, monks, let me see what almsfood you have obtained.’

source: །དེ་དག་དྲང་པོའི་རང་བཞིན་ཅན་ཡིན་པས་བསྟན་པ་དང་། དེ་ཕྲག་དོག་གི་རང་བཞིན་ཅན་ཞིག་མི་བཟོད་པ་སྐྱེས་ནས་བྲམ་ཟེའི་ཁྱེའུ་རྣམས་ལ་བོས་ཏེ་སྨྲས་པ། དགེ་སྦྱོང་མགོ་རེག་འདི་དག་ནི་ཚོད་མ་རོ་སྣ་ཚོགས་དང་ལྡན་པ་དང་འབྲས་ཆན་ཟ་བར་འོས་པ་མ་ཡིན་གྱི་ནས་རུལ་པ་ཟ་བར་འོས་པ་ཡིན་ནོ།
en: “Since they were of honest character, they showed him the almsfood; being of jealous character, he found it unbearable. He called the young brahmins and said, ‘These shaven-headed śramaṇas are not worthy of eating various kinds of tasty sauce and rice, but of eating rotten barley!’

source: །དེ་རྣམས་ཀྱིས་ཀྱང་རྗེས་སུ་ཡི་རངས་ནས་མཁན་པོ་དེ་དེ་ལྟ་ལགས་ཏེ།
en: “They agreed with him:

source: དགེ་སྦྱོང་མགོ་རེག་འདི་དག་ནི་ཚོད་མ་རོ་སྣ་ཚོགས་དང་ལྡན་པ་དང་འབྲས་ཆན་འཚལ་བར་འོས་པ་མ་ལགས་ཀྱི་ནས་རུལ་པ་འཚལ་བར་འོས་པ་ལགས་སོ།
en: ‘True, sir! True! These shaven-headed śramaṇas are not worthy of eating various kinds of tasty sauce and rice, but only of eating rotten barley.’

source: །དེ་ན་ཡང་བྲམ་ཟེའི་ཁྱེའུ་བཟང་པོ་དད་པ་ཅན་དགེ་བའི་བསམ་པ་ཅན་གཉིས་ཤིག་འདུག་པ་དེ་དག་གིས་མཁན་པོ་དེ་སྐད་མ་གསུང་ཤིག །འདི་དག་ནི་བདག་ཉིད་ཆེན་པོ་སྟེ།
en: “Among them, there were two young brahmins who were pious and good and had a virtuous disposition. They said, ‘Sir, do not say that.

source: ལྷའི་བདུད་རྩི་འཚལ་བར་འོས་པ་ལགས་ཀྱི། ནས་རུལ་པ་ནི་འོས་པ་མ་ལགས་སོ་ཞེས་སྨྲས་སོ།
en: These are great people and worthy of eating divine nectar, not rotten barley.’

source: དེའི་ཚེ་དེའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་ཀྱི་ཚོགས་རྣམས་ལ་སྨོད་པར་བྱེད་པ་གང་ཡིན་པ་དེ་ང་ཉིད་ཡིན་ནོ།
en: That one who criticized the attendants of the Perfectly Awakened One Vipaśyin at that time, on that occasion, was indeed me.

source: །བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱར་གཉིས་ཀྱིས་མ་ཚང་བ་གང་ཡིན་པ་དེ་དག་ནི་དགེ་སློང་ལྔ་བརྒྱར་གཉིས་ཀྱིས་མ་ཚང་བ་འདི་དག་ཡིན་ནོ།
en: Those who were the four hundred ninety-eight young brahmins are indeed these four hundred ninety-eight monks.

source: །བྲམ་ཟེའི་ཁྱེའུ་བཟང་པོ་དད་པ་ཅན་དགེ་བའི་བསམ་པ་ཅན་གཉིས་པོ་གང་ཡིན་པ་དེ་ནི་དགེ་སློང་ཤཱ་རིའི་བུ་དང་། མཽད་གལ་གྱི་བུ་འདི་གཉིས་ཡིན་ཏེ།
en: Those two young brahmins who were pious and good and had a virtuous disposition are indeed these monks Śāriputra and Maudgalyāyana.

source: ངས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམ་པར་གཟིགས་ཀྱི་ཉན་ཐོས་སློབ་པ་དང་མི་སློབ་པ་རྣམས་ལ་སེམས་གདུག་པས་ངག་གི་ལས་རྩུབ་མོ་ཕྱུང་བ་དང་། བྲམ་ཟེའི་ཁྱེའུ་ལྔ་བརྒྱར་གཉིས་ཀྱིས་མ་ཚང་བས་རྗེས་སུ་ཡི་རང་བ་དང་། གཉིས་ཀྱིས་རྗེས་སུ་ཡི་མ་རང་བ་གང་ཡིན་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་དེའི་བར་ཡུལ་དགྲ་མཐར་དེ་བཞིན་གཤེགས་པ་དགེ་སློང་ལྔ་བརྒྱར་གཉིས་ཀྱིས་མ་ཚང་བ་དང་ཐབས་ཅིག་ཏུ་ནས་རུལ་གསོལ་ཏོ། །ཤཱ་རིའི་བུ་དང་མཽད་གལ་གྱི་བུ་གཉིས་ནི་ལྷའི་བདུད་རྩི་ལ་ལོངས་སྤྱོད་དོ།
en: Because of the maturation of those actions—namely, my speaking harsh words out of malice toward the Perfectly Awakened One Vipaśyin’s disciples who were undergoing training and had completed training, the four hundred ninety-eight young brahmins’ agreeing, and the two others’ disagreeing—the Tathāgata ate rotten barley with the four hundred ninety-eight monks in Vairambhya at that time, while Śāriputra and Maudgalyāyana enjoyed divine nectar.

source: །དགེ་སློང་དག་དེ་ལྟ་བས་ན་གཅིག་ཏུ་གནག་པ་རྣམས་ཀྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ནི་གཅིག་ཏུ་གནག་པ་ཡིན་ལ་ཞེས་བྱ་བ་ནས། གཅིག་ཏུ་དཀར་བའི་ལས་རྣམས་ལ་བརྩལ་བར་བྱ་སྟེ།
en: “Therefore, monks, the maturation of entirely negative actions is entirely negative . . . you should seek entirely positive actions.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཚུགས་དཀའ་གང་ན་བ་དེར་འདོང་ངོ་།
en: Thereupon the Blessed One said to the venerable Ānanda, “Ānanda, let us go to Ayodhyā.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལྷོ་ཕྱོགས་ལྔ་ལེན་ནས་ལྗོངས་རྒྱུ་ཞིང་གཤེགས་པ་དང་ཚུགས་དཀར་གཤེགས་ནས། ཚུགས་དཀའི་ཆུ་བོ་གང་གཱའི་འགྲམ་ན་བཞུགས་སོ།
en: Then the Blessed One, traveling through Southern Pañcāra, arrived in Ayodhyā, and stayed on the bank of the Ganges near Ayodhyā.

source: །དེ་ནས་དགེ་སློང་ཞིག་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Thereupon a monk went to the Blessed One.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་དེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ལས་བདག་གིས་མདོར་བསྡུས་པའི་ཆོས་ཐོས་ནས་གཅིག་ཏུ་དབེན་པ་བག་ཡོད་པ། རྟུན་པ་དང་ལྡན་པ་བདག་ཉིད་གཏོང་བར་གནས་སོ།
en: Having sat down to one side, the monk said to the Blessed One, “O Blessed One, please teach me a condensed Dharma so that after I have listened to the condensed Dharma from the Blessed One, I will come to dwell alone, in solitude, not carelessly but diligently, directing myself toward myself.

source: །གཅིག་ཏུ་དབེན་པ་བག་ཡོད་པ། རྟུན་པ་དང་ལྡན་པ། བདག་ཉིད་གཏོང་བར་གནས་པ་ན། གང་གི་ཕྱིར་རིགས་ཀྱི་བུ་རྣམས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ། དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་འབྱུང་བར་བགྱིད་པ་ཚངས་པར་སྤྱོད་པའི་མཐའ་བླ་ན་མེད་པ་དེ་ཚེ་དེ་ཉིད་ལ་རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བགྱིས་ཏེ་བསྒྲུབས་ནས་བདག་གི་སྐྱེ་བ་ཟད་དོ།
en: If I dwell alone, in solitude, not carelessly but diligently, directing myself toward myself, I will, in this life, by my own supernormal knowledge, actualize and accomplish the supreme end of the pure life for which the sons of noble families go forth from their homes into homelessness with true faith, having shaved off their hair and beards and donned saffron robes, and understand: ‘My births have been exhausted.

source: །ཚངས་པར་སྤྱོད་པ་ལ་བསྟེན་ཏོ། །བྱ་བ་བྱས་སོ་འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་གོ་བར་བགྱིད་པའི་ཆོས་དེ་ལྟ་བུ་མདོར་བསྡུས་ཏེ་ལེགས་པར་བཤད་དུ་གསོལ་ཞེས་དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཆུ་བོ་གང་གཱ་གང་ན་བ་དེ་ལོགས་སུ་གཟིགས་པ་ལས་བཅོམ་ལྡན་འདས་ཀྱིས་ཆུ་བོ་གང་གཱའི་རྒྱུན་གྱིས་ཤིང་སྡོང་ཆེན་པོ་ཞིག་ཁྱེར་བ་གཟིགས་སོ།
en: The pure life has been lived. What is to be done has been done. I will not know another existence after this one.’ ”

source: །གཟིགས་ནས་ཀྱང་དགེ་སློང་དེ་ལ་བཀའ་སྩལ་པ། དགེ་སློང་ཁྱེད་ཀྱིས་ཆུ་བོ་གང་གཱའི་རྒྱུན་གྱིས་ཤིང་སྡོང་པོ་ཆེན་པོ་ཁྱེར་བ་མཐོང་ངམ། བཙུན་པ་མཐོང་ལགས་སོ། །གལ་ཏེ་འདི་ཚུ་རོལ་གྱི་འགྲམ་དུ་མ་ཆགས། ཕ་རོལ་གྱི་འགྲམ་དང་དབུས་སུ་མ་ཆགས།
en: The Blessed One was gazing at the Ganges, and when he saw a large log being carried along by its current, he asked the monk, “Monk, do you see that large log being carried along by the current of the Ganges?”

source: སྐམ་ལ་མ་ཕྱུང་།
en: “Yes, I do, O Honored One.”

source: མི་དང་མི་མ་ཡིན་པས་མ་བཟུང་། ཀློང་དུ་མ་ནུབ། ཁོང་རུལ་བར་མ་གྱུར་ན་དགེ་སློང་ཤིང་སྡོང་པོ་ཆེན་པོ་དེ་ནི་རིམ་གྱིས་རྒྱ་མཚོར་གཞོལ་བར་འགྱུར། རྒྱ་མཚོར་འབབ་པར་འགྱུར། །རྒྱ་མཚོར་བབ་པར་འགྱུར་བ་དེ་བཞིན་དུ།
en: “If it reaches neither this bank, the opposite bank, nor the middle, is neither washed up on the land nor taken by humans or nonhumans, neither sinks in the water nor decays inside, monk, that large log will in due course flow down to the ocean, descend to the ocean, have descended to the ocean.

source: གལ་ཏེ་དགེ་སློང་ཁྱོད་ཀྱིས་ཚུ་རོལ་ལ་མ་ཆགས་ཞེས་བྱ་བ་ནས་ཁོང་རུལ་བར་མ་གྱུར་ན། དེ་ལྟ་ན་དགེ་སློང་ཁྱོད་རིམ་གྱིས་མྱ་ངན་ལས་འདས་པ་ལ་གཞོལ་བར་འགྱུར། མྱ་ངན་ལས་འདས་པ་ལ་འབབ་པར་འགྱུར། མྱ་ངན་ལས་འདས་པ་ལ་བབ་པར་འགྱུར་རོ།
en: In this way, monk, if you reach neither this bank, . . . nor decay inside, monk, you will in due course flow down to nirvāṇa, descend to nirvāṇa, and have descended to nirvāṇa.”

source: །བཙུན་པ་བདག་གིས་མ་འཚལ་ན་ཚུ་རོལ་གྱི་འགྲམ་ནི་ཅི་ལགས། ཕ་རོལ་གྱི་འགྲམ་ནི་ཅི་ལགས། དབུས་སུ་ཐོགས་པ་ནི་ཅི་ལགས། སྐམ་ལ་ཕྱུང་བ་ནི་ཅི་ལགས། མིས་བཟུང་བ་ནི་ཅི་ལགས། མི་མ་ལགས་པས་བཟུང་བ་ནི་ཅི་ལགས། ཀློང་དུ་ནུབ་པ་ནི་ཅི་ལགས།
en: “O Honored One, I do not understand what this bank is, what the opposite bank is, what touching the middle is, what being washed up on the land is, what being taken by humans is, what being taken by nonhumans is, what sinking in the water is, and what decaying inside is.

source: ཁོང་རུལ་བ་ནི་ཅི་ལགས། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ལས་བདག་གིས་མདོར་བསྡུས་པའི་ཆོས་ཐོས་ནས་ཞེས་བྱ་བ་ནས། འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་བགྱི་བའི་ཆོས་དེ་ལྟ་བུ་མདོར་བསྡུས་ཏེ། ལེགས་པར་བདག་ལ་བཤད་དུ་གསོལ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: O Blessed One, please teach me a condensed Dharma so that after I have listened to the condensed Dharma from the Blessed One, . . . ‘I will not know another existence after this one.’ ”

source: །དགེ་སློང་ཚུ་རོལ་གྱི་འགྲམ་ཞེས་བྱ་བ་དེ་ནི་ནང་གི་སྐྱེ་མཆེད་དྲུག་གི་ཚིག་བླ་དགས་ཡིན་ནོ།
en: “Monk, this bank is a designation for the six internal sense spheres;

source: །ཕ་རོལ་གྱི་འགྲམ་ཞེས་བྱ་བ་དེ་ནི་ཕྱིའི་སྐྱེ་མཆེད་དྲུག་གི་ཚིག་བླ་དགས་ཡིན་ནོ།
en: the opposite bank is a designation for the six external sense spheres;

source: །དབུས་སུ་ཐོགས་པ་ཞེས་བྱ་བ་དེ་ནི་དགའ་བའི་འདོད་ཆགས་ཀྱི་ཚིག་བླ་དགས་ཡིན་ནོ།
en: touching the middle is a designation for desire for pleasure;

source: །སྐམ་ལ་ཕྱུང་བ་ཞེས་བྱ་བ་དེ་ནི་ངའོ་སྙམ་པའི་ང་རྒྱལ་གྱི་ཚིག་བླ་དགས་ཡིན་ནོ།
en: being washed up on the land is a designation for self-conceit;

source: །མིས་བཟུང་བ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་འདི་ན་ལ་ལ་རབ་ཏུ་བྱུང་བ་དང་ཁྱིམ་པ་འདྲེས་པར་གནས་ཏེ། དགའ་བར་མཚུངས་པ་དང་བདེ་བར་མཚུངས་པ་དག །བདེ་ན་བདེ་བ་དང་། སྡུག་བསྔལ་ན་སྡུག་བསྔལ་ཞིང་འཕྲལ་གྱི་བྱ་བ་བྱུང་ཞིང་བྱུང་བ་རྣམས་ཡང་དག་པར་བླངས་ཏེ་མཐར་འབྱིན་པར་བྱེད་པ་ལྟ་བུ་ཡིན་ནོ། །མི་མ་ཡིན་པས་ཟིན་པ་ཞེས་བྱ་བ་ནི་འདི་ལྟར་འདི་ན་ལ་ལ་ཚུལ་ཁྲིམས་སམ། བརྟུལ་ཞུགས་སམ། དཀའ་ཐུབ་བམ།
en: being taken by humans means that here one lives together with people who have gone forth as well as lay people, shares pleasure and happiness with them, is happy at their happiness, suffers at their suffering, and undertakes and finishes tasks whenever they need to be done;

source: ཚངས་པར་སྤྱོད་པ་བསྟེན་པ་འདིས་བདག་ལྷའམ།
en: being taken by nonhumans means that here one leads the pure life, having made this aspiration:

source: ལྷ་གང་ཡང་རུང་བ་ཞིག་ཏུ་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་ནས་ཚངས་པར་སྤྱད་པ་སྤྱོད་པ་ལྟ་བུའོ།
en: ‘By this moral conduct, vow, ascetic practice, or pure life, may I become a god or the retainer of a god’;

source: །ཀློང་དུ་ནུབ་པ་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་འདི་ནི་ལ་ལ་བསླབ་པ་ཕུལ་ནས་བབས་པ་ལྟ་བུ་ཡིན་ནོ། །ཁོང་རུལ་བ་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་འདི་ན་ལ་ལ་ཚུལ་ཁྲིམས་འཆལ་པ།
en: sinking in the water means that here, having abandoned the rules of training, one descends;

source: སྡིག་པའི་ཆོས་ཅན། ཁོང་མྱགས་ཤིང་ཕྱིར་འཛག་པ། ཤིང་རུལ་ལྟ་བུར་གྱུར་པ། ལུང་བོང་ལྟར་སྤྱོད་པ། དགེ་སྦྱོང་མ་ཡིན་པར་དགེ་སྦྱོང་དུ་ཁས་འཆེ་བ། ཚངས་པར་སྤྱོད་པ་མ་ཡིན་པར་ཚངས་པར་སྤྱོད་པར་ཁས་འཆེ་བ་ཡོད་པ་ལྟ་བུ་ཡིན་ཏེ། དགེ་སློང་ཁྱོད་ཀྱིས་གལ་ཏེ་དེ་བཞིན་དུ་ཚུ་རོལ་གྱི་འགྲམ་དུ་མ་ཐོགས་ཞེས་བྱ་བ་ནས།
en: decaying inside means that here one is a violator of moral conduct and possessor of evil qualities—one’s inside is rotten and leaking out like decayed wood, one behaves like a sheep or donkey, one falsely claims to be a śramaṇa, and one falsely claims to be leading the pure life. Monk, if you thus reach neither this bank, . . . you will . . . have descended to nirvāṇa.”

source: མྱ་ངན་ལས་འདས་པ་ལ་བབ་པར་འགྱུར་རོ་ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ། །དེ་ནས་དགེ་སློང་དེས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་དགའ་སྟེ་རྗེས་སུ་ཡི་རངས་ནས།
en: The monk rejoiced in and praised the words of the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་སོང་ངོ་།
en: He bowed low until his forehead touched the Blessed One’s feet, and he departed from the Blessed One’s presence.

source: །དེ་ནས་དགེ་སློང་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཤིང་སྡོང་པོ་ཆེན་པོའི་དཔེ་འདིའི་གདམས་ངག་གིས་གཏམས་ཏེ་གཅིག་པུ་དབེན་པ་བག་ཡོད་པ། རྟུན་པ་དང་ལྡན་པ། བདག་ཉིད་གཏོང་བར་གནས་པ་ན།
en: Then the monk, instructed by the Blessed One through this teaching called the simile of the large log, dwelt alone, in solitude, not carelessly but diligently, directing himself toward himself.

source: གང་གི་ཕྱིར་རིགས་ཀྱི་བུ་རྣམས་སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ་དད་པ་ཡང་དག་པ་ཁོ་ནས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་ཚངས་པར་སྤྱོད་པའི་མཐའ་བླ་ན་མེད་པ་དེ་ཚེ་དེ་ཉིད་ལ་རང་གི་མངོན་པར་ཤེས་པས་མངོན་སུམ་དུ་བྱས་ཏེ་བསྒྲུབས་ནས་བདག་གི་སྐྱེ་བ་ཟད་དོ།
en: In that life, by his own supernormal knowledge, he actualized and accomplished the supreme end of the pure life for which the sons of noble families go forth from their homes into homelessness with true faith, having shaved off their hair and beards and donned saffron robes. He knew and understood: “My births have been exhausted.

source: །འདི་ལས་སྲིད་པ་གཞན་མི་ཤེས་སོ་ཞེས་བྱ་བར་ཤེས་ནས་གོ་བར་བྱས་ཏེ། ཚེ་དང་ལྡན་པ་དེ་དགྲ་བཅོམ་པ་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བར་གྱུར་ཏོ།
en: I will not know another existence after this one.” That venerable one became an arhat whose mind had been completely liberated.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་དང་ཧ་ཅང་ཡང་མི་རིང་བ་ཞིག་ན་གནག་རྫི་དགའ་བོ་ཞེས་བྱ་བ་འདུག་པར་གྱུར་པ་ཁར་བ་ལ་བརྟེན་ནས་གནག་སྐྱོང་ཞིང་འདུག་པ་ལས་དེའི་ཁར་བས་སྦལ་པ་ཞིག་བརྫིས་སོ། །དེ་གནད་རྣམས་ཆད་ལ་ཐུག །ཚིགས་རྣམས་བྱེ་ལ་ཐུག་པ་དང་སེམས་བསྐྱེད་པ།
en: At that time, near the Blessed One, a herdsman named Nanda stood, leaning on a stick and watching cattle.

source: གལ་ཏེ་བདག་གིས་ལུས་འགུལ་ཏམ། སྐད་ཕྱུང་ན་གཞི་དེས་གནག་རྫི་དགའ་བོའི་གཏམ་གྱི་བར་ཆད་དུ་འགྱུར་རོ་སྙམ་དུ་རིག་ནས། བཅོམ་ལྡན་འདས་ལ་མངོན་པར་དད་པར་བྱས་ནས་ཤི་བ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་སུ་སྐྱེས་སོ།
en: A frog was squashed by his stick. The frog, having had its vital organs cut and been split at its joints, gave rise to the thought, “If I move my body or utter a cry, by this cause I will prevent Nanda, the herdsman, from listening to the discourse.” Filled with faith in the Blessed One, it died and was born among the gods attendant on the Four Great Kings.

source: །དེ་ནས་གནག་རྫི་དགའ་བོས་ཁར་བ་ཕྱོགས་གཅིག་ཏུ་བཞག་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: Then Nanda, the herdsman, set his stick to one side and went to the Blessed One. When he arrived, he bowed low until his forehead touched the Blessed One’s feet, and then he sat down to one side.

source: །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་བཅོམ་ལྡན་འདས་ལ་གནག་རྫི་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བདག་ནི་ཚུ་རོལ་གྱི་འགྲམ་དུ་མི་ཆགས། ཕ་རོལ་གྱི་འགྲམ་དུ་མི་ཆགས། དབུས་སུ་མི་ཆགས།
en: Having sat down, Nanda, the herdsman, said to the Blessed One, “O Honored One, I will reach neither this bank, the opposite bank, nor the middle;

source: སྐམ་ལ་མི་འབྱུང་། མིས་མི་གཟུང་། མི་མ་ལགས་པས་མི་གཟུང་།
en: I will be neither washed up on the land nor taken by humans or nonhumans;

source: ཀློང་དུ་མི་འབྱིན།
en: and I will neither sink in the water nor decay inside.
